In [2]:
from sqlalchemy import create_engine


engine = create_engine('mysql+pyodbc://telecom')
%load_ext sql
%sql engine
%config SqlMagic.autopandas = True

Found pyproject.toml from '/Users/jacky/github/telecom'

# Tower Information

In [7]:
%sql SHOW TABLES

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

            Tables_in_telecom
0                    cinfo_xy
1         sample_sight_201308
2          sample_user_201308
3  serv_acct_item_0838_201308
4  serv_acct_item_0838_201406
5     tb_asz_cdma_0838_201308
6     tb_asz_cdma_0838_201406
7                       tower
8                tower_center
9            tower_hot_201308

# Quick Look at various tables of tower

In [10]:
%sql  SELECT * FROM cinfo_xy LIMIT 10;

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

  CELL_10 CELL_16         LON        LAT           X            Y
0       1    0001  103.992996  30.721399  403.545990  3400.520020
1       2    0002  103.992996  30.721399  403.545990  3400.520020
2       3    0003  103.992996  30.721399  403.545990  3400.520020
3       4    0004  104.161003  30.629101  419.562012  3390.159912
4       5    0005  104.161003  30.629101  419.562012  3390.159912
5       6    0006  104.161003  30.629101  419.562012  3390.159912
6       7    0007  103.681000  30.948799  373.957001  3426.050049
7       8    0008  103.681000  30.948799  373.957001  3426.050049
8       9    0009  103.681000  30.948799  373.957001  3426.050049
9      10    000A  103.647003  30.849001  370.574005  3415.020020

In [11]:
%sql  SELECT * FROM tower LIMIT 10;

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

,CELL_10,CELL_16,LON,LAT,X,Y,DEYANG_CENTER
0,1,0001,103.992996,30.721399,403.545990,3400.520020,0
1,2,0002,103.992996,30.721399,403.545990,3400.520020,0
2,3,0003,103.992996,30.721399,403.545990,3400.520020,0
3,4,0004,104.161003,30.629101,419.562012,3390.159912,0
4,5,0005,104.161003,30.629101,419.562012,3390.159912,0
5,6,0006,104.161003,30.629101,419.562012,3390.159912,0
6,7,0007,103.681000,30.948799,373.957001,3426.050049,0
7,8,0008,103.681000,30.948799,373.957001,3426.050049,0
8,9,0009,103.681000,30.948799,373.957001,3426.050049,0
9,10,000A,103.647003,30.849001,370.574005,3415.020020,0

In [12]:
%sql  SELECT * FROM tower_center LIMIT 10;

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

  CELL_10 CELL_16         LON        LAT           X            Y
0   13401    3459  104.374001  31.126900  440.292999  3445.209961
1   13402    345A  104.374001  31.126900  440.292999  3445.209961
2   13403    345B  104.374001  31.126900  440.292999  3445.209961
3   13407    345F  104.415001  31.112700  444.195007  3443.620117
4   13408    3460  104.415001  31.112700  444.195007  3443.620117
5   13409    3461  104.415001  31.112700  444.195007  3443.620117
6   13410    3462  104.389000  31.135500  441.729004  3446.159912
7   13411    3463  104.389000  31.135500  441.729004  3446.159912
8   13412    3464  104.389000  31.135500  441.729004  3446.159912
9   13422    346E  104.382004  31.091299  441.033997  3441.260010

In [13]:
%sql  SELECT * FROM tower_hot_201308 LIMIT 10;

Running query in 'mysql+pyodbc://telecom'

10 rows affected.

,CELL_10,CELL_16,LON,LAT,X,Y,MAIN_CENTER_FLAG,HOT_FLAG,HOT_MAIN_FLAG,HOT_OTHER_FLAG
0,1,0001,103.992996,30.721399,403.545990,3400.520020,0,0,0,0
1,2,0002,103.992996,30.721399,403.545990,3400.520020,0,0,0,0
2,3,0003,103.992996,30.721399,403.545990,3400.520020,0,0,0,0
3,4,0004,104.161003,30.629101,419.562012,3390.159912,0,0,0,0
4,5,0005,104.161003,30.629101,419.562012,3390.159912,0,0,0,0
5,6,0006,104.161003,30.629101,419.562012,3390.159912,0,0,0,0
6,7,0007,103.681000,30.948799,373.957001,3426.050049,0,0,0,0
7,8,0008,103.681000,30.948799,373.957001,3426.050049,0,0,0,0
8,9,0009,103.681000,30.948799,373.957001,3426.050049,0,0,0,0
9,10,000A,103.647003,30.849001,370.574005,3415.020020,0,0,0,0

# number of observations

In [16]:
%%sql

SELECT 
    (SELECT COUNT(*) FROM cinfo_xy) AS cinfo_xy,
    (SELECT COUNT(*) FROM tower) AS tower,
    (SELECT COUNT(*) FROM tower_center) AS tower_center,
    (SELECT COUNT(*) FROM tower_hot_201308) AS tower_hot_201308;

Running query in 'mysql+pyodbc://telecom'

1 rows affected.

   cinfo_xy  tower  tower_center  tower_hot_201308
0     40569  40569           427             40569

we can see that the towers in the table *tower_center* those in *tower* table with center flag

In [17]:
%%sql
SELECT 
    COUNT(*)
FROM 
    tower
WHERE DEYANG_CENTER = 1;

Running query in 'mysql+pyodbc://telecom'

1 rows affected.

   COUNT(*)
0       427

# number of observations for each flag in table tower_hot_201308

In [18]:
%%sql

SELECT
    (SELECT COUNT(*) FROM tower_hot_201308 WHERE MAIN_CENTER_FLAG = 1) AS MAIN_CENTER_FLAG,
    (SELECT COUNT(*) FROM tower_hot_201308 WHERE HOT_FLAG = 1) AS HOT_FLAG,
    (SELECT COUNT(*) FROM tower_hot_201308 WHERE HOT_MAIN_FLAG = 1) AS HOT_MAIN_FLAG,
    (SELECT COUNT(*) FROM tower_hot_201308 WHERE HOT_OTHER_FLAG = 1) AS HOT_OTHER_FLAG;

Running query in 'mysql+pyodbc://telecom'

1 rows affected.

   MAIN_CENTER_FLAG  HOT_FLAG  HOT_MAIN_FLAG  HOT_OTHER_FLAG
0               427       425            132             293